In [4]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder

In [19]:
df = pd.DataFrame({"Categorical" : ["A", "B", "A", "C", "K", "E"]})
df

  Categorical
0           A
1           B
2           A
3           C
4           K
5           E

In [20]:
df['Categorical'].unique()

array(['A', 'B', 'C', 'K', 'E'], dtype=object)

In [21]:
pd.get_dummies(df['Categorical'])

   A  B  C  E  K
0  1  0  0  0  0
1  0  1  0  0  0
2  1  0  0  0  0
3  0  0  1  0  0
4  0  0  0  0  1
5  0  0  0  1  0

In [22]:
df['Categorical'].unique()

array(['A', 'B', 'C', 'K', 'E'], dtype=object)

In [23]:
lbl = LabelEncoder()

In [24]:
df

  Categorical
0           A
1           B
2           A
3           C
4           K
5           E

In [25]:
df['converted'] = lbl.fit_transform(df['Categorical'])
df

  Categorical  converted
0           A          0
1           B          1
2           A          0
3           C          2
4           K          4
5           E          3

In [26]:
df['Inverse Transform'] = lbl.inverse_transform(df['converted'])
df

  Categorical  converted Inverse Transform
0           A          0                 A
1           B          1                 B
2           A          0                 A
3           C          2                 C
4           K          4                 K
5           E          3                 E